CREATE TABLE vehicle (
	name          VARCHAR(30) PRIMARY KEY,
	manufacturer   VARCHAR(30) NOT NULL,
	price          DECIMAL(10) NOT NULL,
	color		   VARCHAR(30),
	dimensions     VARCHAR(30),
	cargo_size     VARCHAR(30),
	load_capacity  VARCHAR(30),
	canopy		   BOOLEAN,
	wheels		   INT,
	wheel_size     VARCHAR(30),
	battery        VARCHAR(30),
	maximum_output VARCHAR(30),
	maximum_speed  VARCHAR(30),
	mileage        VARCHAR(30),
	charging_time  VARCHAR(30),
	weight         VARCHAR(30),
	views		   INT DEFAULT 0
);
INSERT INTO vehicle (name, manufacturer, price, color ,dimensions, cargo_size, load_capacity, canopy, wheels, wheel_size, battery, maximum_output, maximum_speed, mileage, charging_time, weight)
VALUES
('씽씽전동삼륜차 600', '신일종합농기계', 2400000, '레드', '2050x700x1100', '460x700x230', '150kg', 0, 3, '앞/뒤: 10인치 3.00','48V 20Ah', '650W', '20km/h', '30km', '8시간', '100kg'),
('씽씽전동삼륜차 500', '신일종합농기계', 2300000, '레드', '1730x700x970', 'O', NULL, 0, 3, '앞/뒤: 8인치: 3.00','48V', '500W', '25km/h', '50km', '8시간', '110kg'),
('에코로 골든체어', 'AU테크', 1498000, '레드, 블루', '1110x525x920', 'O', NULL, 0, 4, '215x70(솔리드타이어)', '24V 12Ah', '300W', '8km/h', '24km', '5시간', '47kg'),
('에코로 X3', 'AU테크', 1648000, '레드', '1500x660x1040', '390x350x200', '10kg', 0, 3, '3.00-8 튜브리스타이어', '48V 20Ah', '960W', '25km/h', '60km', '8시간', '105kg'),
('에코로 X5', 'AU테크', 2490000, '레드', '2050x800x1050', 'O', NULL, 0, 3, '3.00-8 튜브리스 타이어', '48V 20/32Ah', '960W', '20km/h', '50km/80km', '6.5/10시간', '122kg'),
('에코로 XD', 'AU테크', 2998000, '레드, 화이트', '1640x1045x1650', '420x480x220', '250kg', 1, 4, '3.50-8 튜브리스', '48V 20/32Ah', '960W', '25km/h', '60km/96km', '8/13시간', '165kg'),
('알파-S', '디엔제이', 2450000, '레드, 화이트', '1350x650x1360', NULL, NULL, 0, 4, NULL, '48V 20Ah', '500W', '12km/h, 15km/h', '40km', '8시간', NULL),
('아미고-S', '디엔제이', 2500000, '레드, 화이트','1750x700x1100', 'O', NULL, 0 ,4, NULL, '48V 20Ah', '800W', '20km/h', '40km', '8시간', NULL),
('프리고-S(옵션)', '디엔제이', 2500000, '와인레드, 화이트', '1450x640x1120', 'O', NULL, 0, 4, NULL, '48V 20Ah', '800W', '20km/h', '40km', '8시간', NULL),
('전동전기삼륜차 SR7', '신일테크', 2080000, '블랙, 화이트', '1550x700x1450', 'O', '30kg', 0, 3, NULL, '48V 20Ah', '600W', '24km/h', NULL, '8시간', NULL),
('전동전기삼륜차 SR8', '신일테크', 2200000, '블랙, 화이트', '2050x700x1150', 'O', '80kg', 0, 3, NULL, '48V 20Ah', '600W', '24km/h', NULL, '8시간', NULL),
('전동전기삼륜차 SR7 캐노피', '신일테크', 2430000, '블랙, 화이트', '1450x640x1660', 'O', '30kg', 1, 3, NULL, '48V 20Ah', '600W', '24km/h', '30km', '8시간', NULL),
('전동전기삼륜차 SR8 캐노피', '신일테크', 2550000, '블랙, 화이트', '2050x700x1350', 'O', '80kg', 1, 3, NULL, '48V 20Ah', '600W', '24km/h', '30km', '8시간', NULL),
('S-600', 'JDY', 2800000, '화이트', '1500x960x1630', '전: 510x320x270 후: 430x270x390', NULL, 1, 4, '3.50-8 튜브리스', '48V 20Ah', '650W', '20km/h', '30km', '6시간', '250kg'),
('KING', 'JDY', 3150000, '그레이', '1830x970x1630', '480x450x210', NULL, 1, 4, '110/80-8 튜브리스', '48V 20Ah', '650W', '20km/h', '30km', '6시간', '250kg'),
('C-1', 'JDY', 2450000, '화이트', '1650x700x1100', NULL, NULL, 0, 4, '3.00-10 튜브리스', '48V 20Ah', '500W', '20km/h', '30km', '6시간', '140kg'),
('루이', 'JDY', 2550000, '스카이블루', '1610x690x1010', NULL, NULL, 0, 4, '3.00-10 튜브리스', '48V 20Ah', '800W', '20km/h', '30km', '6시간', '140kg'),
('YL500 캐노피&방풍커튼', 'JDY', 2700000, '블루', '1380x700x1530', 'O', NULL, 1, 4, '3.00-8 튜브리스', '60V 20Ah', '500W', '20km/h', '30km', '8시간', '180kg'),
('YL실버플러스 캐노피&방풍커튼', 'JDY', 3300000, '레드', '1920x700x1640', '640x500x215', NULL, 1, 4, '3.00-8 튜브리스', '60V 20Ah', '650W', '20km/h', '30km', '6시간', '250kg'),
('S-450', 'JDY', 3400000, '골드', '2050x980x1640', '540x860x300', NULL, 1, 3, '3.00-10 튜브리스', '60V 32Ah', '1000W', '20km/h', '30km', '6시간', '280kg'),
('S-3500', 'JDY', 2500000, '라이트그린', '2100x710x1080', '680x500x210', NULL, 0, 3, '3.00-10 튜브리스', '48V 20Ah', '500W', '20km/h', '35km', '6시간', '250kg'),
('YL500 캐노피형', 'JDY', 2550000, '블루', '1380x700x1530', 'O', NULL, 1, 4, '3.00-8 튜브리스', '60V 20Ah', '500W', '20km/h', '30km', '8시간', '180kg'),
('YL실버플러스 캐노피형', 'JDY', 3150000, '레드', '1920x700x1640', '640x500x215', NULL, 1, 4, '3.00-8 튜브리스', '60V 20Ah', '650W', '20km/h', '30km', '6시간', '250kg'),
('YL500s', 'JDY', 2300000, '블루', '1380x700x1000', 'O', NULL, 0, 4, '3.00-8 튜브리스', '60V 20Ah', '500W', '20km/h', '30km', '8시간', '180kg'),
('YL실버플러스', 'JDY', 2800000, '레드', '1920x700x1130', '640x500x215', NULL, 0, 4, '3.00-8 튜브리스', '60V 20Ah', '650W', '20km/h', '30km', '6시간', '250kg'),
('베가 T510', '베가모터스', 2980000, '레드', '1980x760x1150', '530x730x220', NULL, 0, 4, '3.50-8 튜브리스', '60V 20Ah', '650W', '20km/h', '30km', '6시간', NULL),
('베가 T510R', '베가모터스', 3300000, '레드', '1980x760x1700', '530x730x220', NULL, 1, 4, '3.50-8 튜브리스', '60V 20Ah', '650W', '20km/h', '30km', '6시간', NULL),
('베가 T530', '베가모터스', 2850000, '레드', '1600x750x1050', '530x400', NULL, 0, 4, '3.50-8 튜브리스', '60V 20Ah', '650W', '20km/h', '30km', '6시간', NULL),
('베가 T530R', '베가모터스', 3150000, '레드', '1600x750x1600', '530x400', NULL, 1, 4, '3.50-8 튜브리스', '60V 20Ah', '650W', '20km/h', '30km', '6시간', NULL),
('베가 T570', '베가모터스', 2960000, '레드', '1980x760x1150', '530x730x220', NULL, 0, 4, '3.50-8 튜브리스', '60V 20Ah', '650W', '20km/h', '30km', '6시간', NULL),
('베가 T570R', '베가모터스', 3280000, '레드', '1980x760x1700', '530x730x220', NULL, 1, 4, '3.50-8 튜브리스', '60V 20Ah', '650W', '20km/h', '30km', '6시간', NULL),
('베가 T5100', '베가모터스', 2800000, '레드', '1980x720x990', '500x600x210', NULL, 0, 4, '14" 튜브리스', '60V 20Ah', '500W', '20km/h', '30km', '6시간', NULL),
('베가 T5100R', '베가모터스', 3150000, '레드', '1980x720x990', '500x600x210', NULL, 1, 4, '14" 튜브리스', '60V 20Ah', '500W', '20km/h', '30km', '6시간', NULL),
('베가 T5500', '베가모터스', 2650000, '레드', '1550x700x1100', 'O', NULL, 0, 4, '14Inch 튜브리스', '60V 20Ah', '800W', '20km/h', '30km', '6시간', NULL),
('베가 T5500R', '베가모터스', 2850000, '레드', '1550x700x1600', 'O', NULL, 1, 4, '14Inch 튜브리스', '60V 20Ah', '800W', '20km/h', '30km', '6시간', NULL),
('베가 A330', '베가모터스', 1900000, '레드', '1550x720x1000', '400x300', NULL, 0, 3, '3.00-8 튜브리스', '48V 20Ah', '650W', '20km/h', '30km', '6시간', NULL),
('나드리100', '케어라인', 1773000, '레드', '1275x610x1180', 'O', NULL, 0, 4, '10"', '40Ah', NULL, '10km/h', '35km', NULL, '92kg'),
('나드리110', '케어라인', 1889000, '레드', '1274x640x1170', 'O', NULL, 0, 4, '12"', '40Ah', NULL, '10.5km/h', '35km', NULL, '98kg'),
('나드리200', '케어라인', 2073000, '옐로우', '1274x640x1170', 'O', NULL, 0, 4, '12"', '50Ah', NULL, '12km/h', '35km', NULL, '103kg'),
('나드리210', '케어라인', 2146000, '블랙', '1330x653x1212', 'O', NULL, 0, 4, '12"', '50Ah', NULL, '12km/h', '35km', NULL, '112kg'),
('나드리500', '케어라인', 2572000, '블랙', '1400x686x1323', 'O', NULL, 0, 4, '13"', '62Ah', NULL, '15km/h', '35km', NULL, '135kg'),
('DP201S', '휴모빌', 2017000, '레드', '1360x650x1250', 'O', NULL, 0, 4, NULL, '62Ah', NULL, '12km/h', '35km', NULL, '123kg'),
('D301S', '휴모빌', 2669000, '레드', '1390x695x1300', 'O', NULL, 0, 4, NULL, '75Ah', NULL, '14km/h', '35km', NULL, '157.6kg'),
('PF6', '이지무브', 1685000, '레드, 실버', '1220x610x910', '300x220x200', NULL, 0, 4, '12Inch', '12V 50Ah', '450W', '10km/h', '35km', NULL, '74kg'),
('PF2K', '이지무브', 1906000, '오렌지, 브론즈', '1350x610x1100', 'O', NULL, 0, 4, '지름 310', '24V 50Ah', '550W', '11km/h', '50km', NULL, '98kg'),
('S17', '이지무브', 2700000, '레드, 화이트', '1350x670x1180', NULL, NULL, 0, 4, '앞: 지름 265, 뒤: 지름 310', '12V 55Ah', '700W', '12km/h', '35km', NULL, '125kg'),
('SC-1', '샵라이더', 2032000, '레드', '1300x610x1310', 'O', NULL, 0, 4, '13"', '12V 50Ah', NULL, '15km/h', '40km', NULL, '136kg'),
('칸타타300', 'MPS코리아', 2067000, '레드, 옐로우, 실버', '1380x630x1300', 'O', NULL, 0, 4, '13"', '55Ah', NULL, '14km/h', '35km', NULL, '114kg');














